-- insert into Товары 
-- values (
--  N'INSERT TEST2', 99999, 99999
-- 
-- )
-- update Товары set Цена = 1234 where Наименование = N'1Тест1'

-- delete from Товары where Цена = 99999

-- select * from Товары


-- убедимся, что товар есть
-- INSERT INTO Товары(Наименование, Цена, Количество)
-- VALUES (N'Стул', 100, 10);

-- создание заказа
-- INSERT INTO Заказы(Номер_заказа, Наименование_товара, Цена_продажи, Количество, Заказчик)
-- VALUES ('Z011', N'Стул', 100, 2, N'ТехМаг');


-- delete from Заказы where Номер_заказа = N'Z011' 
DELETE FROM Заказчики WHERE Наименование_фирмы = N'ТехМаг';

