SELECT
    (
        SELECT
            AVG(Цена_продажи)
        FROM
            Заказы
        WHERE
            Наименование_товара = N'Ноутбук'
    ) AS "Средняя_цена_Ноутбук",
    (
        SELECT
            AVG(Цена_продажи)
        FROM
            Заказы
        WHERE
            Наименование_товара = N'Телефон'
    ) AS "Средняя_цена_Телефон",
    (
        SELECT
            AVG(Цена_продажи)
        FROM
            Заказы
        WHERE
            Наименование_товара = N'Планшет'
    ) AS "Средняя_цена_Планшет";

-- можно и без "" для alias